{
	"1.0.0": {
		"en": "First test version"
	},
	"1.0.1": {
		"en": "Update app images and readme to pass Homey review"
	},
	"1.0.2": {
		"en": "Fix search when selecting a device. Invert icon colour in darkmode.. Improve slider usability and add the value to the widget"
	},
	"1.0.3": {
		"en": "Made the range bars thicker. Added buttons for non setable boolean capabilities."
	},
	"1.0.4": {
		"en": "Enabled slider tap to set position. Workaround for slider issue to reset position if finger moved off the slider. Added log to app settings page for debugging."
	},
	"1.0.5": {
		"en": "Restyled the controls. Added edit mode to enable hiding of capabilities."
	},
	"1.0.6": {
		"en": "Fix capability hiding."
	},
	"1.1.0": {
		"en": "Added ENUM capability type. Merged changes supplied by Markus for adding readonly and dense modes and for fetching custom icons."
	},
	"1.1.1": {
		"en": "Fix to select active ENUM capability value. Rename the 'Enable runtime configuration' setting to 'Enable Edit Mode' and add hints to the settings."
	},
	"1.1.2": {
		"en": "Fix height of widget when lines wrap and edit mode is enabled in dense mode"
	},
	"1.1.3": {
		"en": "Fix for long value text overlapping the next row. Added colour to the Hue capability slider. Add temperature colour to the colour temperature slider."
	},
	"1.1.4": {
		"en": "Fix for long value text overlapping the next row when not in dense mode."
	},
	"1.1.5": {
		"en": "Fix for read-only values not updating in the widget."
	},
	"1.1.6": {
		"en": "Add a status widget that is update via a Flow action card."
	},
	"1.1.7": {
		"en": "Added Dense mode to status widget. Changed the action Flow card to use colour pickers for the background and text colours."
	},
	"1.1.8": {
		"en": "Save abd restore the status widget values for persistence through restarts."
	},
	"1.1.9": {
		"en": "Fix Send Log. Fix false error message in the log each time the page is opened."
	},
	"1.1.10": {
		"en": "Added option to switch off the X. Moved the X to the top right of the widget. Taping on the X sets the background to the default colour and displays 'No Notifications'."
	},
	"1.1.11": {
		"en": "Made the title and Status optional parameteres in the Flow action card. Set both to empty to clear the widget."
	},
	"1.1.12": {
		"en": "Fixed issue with settings capabilities in the Enhanced Device Widget when they change externally. Cache status widget values to ensure values are refreshed when the widget is not visible."
	},
	"1.1.13": {
		"en": "Make cr/lf HTML compatible for multi-line status."
	}
}
